
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Отбор.Источник.Значение) И 
		ЭтотОбъект.Отбор.Источник.Значение = ПараметрыСеанса.УдаляемыйДокумент Тогда
		нзЭЧ = РегистрыСведений.ЭлектронныеЧекиККМ.СоздатьНаборЗаписей();
		нзЭЧ.Отбор.Источник.Значение = ЭтотОбъект.Отбор.Источник.Значение;
		нзЭЧ.Отбор.Источник.Использование = Истина;
		нзЭЧ.Прочитать();
		ЭтотОбъект.ДополнительныеСвойства.Вставить("нзЭЧ", нзЭЧ);
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	нзЭЧ = Неопределено;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("нзЭЧ", нзЭЧ) Тогда
		ПараметрыСеанса.УдаляемыйДокумент = Неопределено;
		нзЭЧ.Записать();
	КонецЕсли;
	
КонецПроцедуры
