
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НовыйЧекКоррекцияПрихода(Команда)
	НовыйДокументКассовыйЧекКоррекция(1);
КонецПроцедуры

&НаКлиенте
Процедура НовыйЧекКоррекцияРасхода(Команда)
	НовыйДокументКассовыйЧекКоррекция(2);
КонецПроцедуры

&НаКлиенте
Процедура НовыйДокументКассовыйЧекКоррекция(ОперацияИндекс, Отказ = Ложь)
	Если ОперацияИндекс = 1 Тогда
		ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств");
	ИначеЕсли ОперацияИндекс = 2 Тогда
		ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств");
	КонецЕсли;
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ТипРасчета", ТипРасчета));
	
	ОткрытьФорму("Документ.КассовыйЧекКоррекции.ФормаОбъекта", СтруктураПараметры, Элементы.Список);
	
КонецПроцедуры

//#КонецОбласти

