
Процедура ОткрытьКассовуюСмену(ККТ) Экспорт

	ОбработкаОбслуживания = Неопределено;
	ОбъектДрайвера = Неопределено;
	
	ПолучитьСерверТО().ПолучитьОбъектДрайвера(ККТ, ОбработкаОбслуживания, ОбъектДрайвера);
	
	Если ОбработкаОбслуживания = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка получения обработки обслуживания");
	Иначе
		ПараметрыОткрытияЗакрытияСмены = МенеджерОборудованияКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
		АвторизованныйПользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
		Если Не ПустаяСтрока(АвторизованныйПользователь.Наименование) Тогда
			ПараметрыОткрытияЗакрытияСмены.Кассир = АвторизованныйПользователь.Наименование;
		КонецЕсли;
		
		ОбъектДрайвера.Вставить("ПараметрыОткрытияЗакрытияСмены", ПараметрыОткрытияЗакрытияСмены);
		
		РезультатВыполнения = ОбработкаОбслуживания.ОткрытьСмену(ОбъектДрайвера);
		
		Если РезультатВыполнения <> ПредопределенноеЗначение("Перечисление.ТООшибкиОбщие.ПустаяСсылка") Тогда
			ОбщегоНазначения.СообщитьОбОшибке(ОбъектДрайвера.ОписаниеОшибки);
		Иначе
			КассаККМ = ПолучитьСерверТО().ПолучитьКассуККМ(ККТ);
			
			ПараметрыКоманды = Новый Структура();
			ПараметрыКоманды.Вставить("ВыполняемаяКоманда", "ОткрытьСмену");
			ПараметрыКоманды.Вставить("ФискальноеУстройство", ККТ);
			ПараметрыКоманды.Вставить("КассаККМ", КассаККМ);
			Попытка
				ПараметрыКоманды.Вставить("ТипОборудования", ОбработкаОбслуживания.мПараметрыПодключения.ТипОборудования);
			Исключение
				ПараметрыКоманды.Вставить("ТипОборудования", "ККТ");
			КонецПопытки;
			КассовыеСменыВызовСервера.ПослеВыполненияКомандыФискальнымУстройством(ПараметрыКоманды);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ЗакрытьКассовуюСмену(ККТ, ДокументКассоваяСмена, ОбрабатыватьЧекиККМ = Истина) Экспорт
	
	ОбработкаОбслуживания = Неопределено;
	ОбъектДрайвера = Неопределено;

	ПолучитьСерверТО().ПолучитьОбъектДрайвера(ККТ, ОбработкаОбслуживания, ОбъектДрайвера);
	
	Если ОбработкаОбслуживания = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка получения обработки обслуживания");
	Иначе
		ПараметрыОткрытияЗакрытияСмены = МенеджерОборудованияКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
		АвторизованныйПользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
		Если Не ПустаяСтрока(АвторизованныйПользователь.Наименование) Тогда
			ПараметрыОткрытияЗакрытияСмены.Кассир = АвторизованныйПользователь.Наименование;
		КонецЕсли;
		
		ОбъектДрайвера.Вставить("ПараметрыОткрытияЗакрытияСмены", ПараметрыОткрытияЗакрытияСмены);
		
		РезультатВыполнения = ОбработкаОбслуживания.ЗакрытьСмену(ОбъектДрайвера);
		
		Если РезультатВыполнения <> ПредопределенноеЗначение("Перечисление.ТООшибкиОбщие.ПустаяСсылка") Тогда
			ОбщегоНазначения.СообщитьОбОшибке(ОбъектДрайвера.ОписаниеОшибки);
		Иначе
			ПараметрыКоманды = Новый Структура();
			ПараметрыКоманды.Вставить("ВыполняемаяКоманда", "ЗакрытьСмену");
			ПараметрыКоманды.Вставить("КассоваяСмена", ДокументКассоваяСмена);
			ПараметрыКоманды.Вставить("ОбрабатыватьЧекиККМ", ОбрабатыватьЧекиККМ);
			Если (ОбъектДрайвера.ВыходныеПараметры.Количество() > 4) И ОбъектДрайвера.ВыходныеПараметры[4] <> Неопределено Тогда
				ПараметрыКоманды.Вставить("ФискальныеДанныеСтруктура", ОбъектДрайвера.ВыходныеПараметры[4]);
			КонецЕсли;
			Если (ОбъектДрайвера.ВыходныеПараметры.Количество() > 5) И ОбъектДрайвера.ВыходныеПараметры[5] <> Неопределено Тогда
				ПараметрыКоманды.Вставить("ФискальныеДанныеXMLСтрока", ОбъектДрайвера.ВыходныеПараметры[5]);
			КонецЕсли;
			Попытка
				ПараметрыКоманды.Вставить("ТипОборудования", ОбработкаОбслуживания.мПараметрыПодключения.ТипОборудования);
			Исключение
				ПараметрыКоманды.Вставить("ТипОборудования", "ККТ");
			КонецПопытки;
			КассовыеСменыВызовСервера.ПослеВыполненияКомандыФискальнымУстройством(ПараметрыКоманды);
			СозданныеДокументы = Новый Массив;
			Если ПараметрыКоманды.Свойство("СозданныеДокументы", СозданныеДокументы) Тогда
				Для Каждого СозданныйДокумент Из СозданныеДокументы Цикл
					СозданныйДокумент.ПолучитьФорму().Открыть();
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
